var typeList = {
    "2001": {
        "list": {
            "3001": "产品策划",
            "3002": "游戏策划",
            "3003": "产品运营",
            "3004": "游戏运营",
            "3051": "网络营销理论",
            "3053": "SEO",
            "3054": "SEM",
            "3296": "新媒体营销"
        },
        "name": "互联网产品"
    },
    "2002": {
        "list": {
            "3005": "C",
            "3006": "C++",
            "3007": "Java进阶",
            "3008": "PHP",
            "3009": "C#/.Net",
            "3010": "VB.NET",
            "3011": "Ruby",
            "3012": "Javascript",
            "3013": "Perl",
            "3014": "SQL",
            "3015": "Object-C",
            "3016": "Lua",
            "3017": "Flash AS3.0",
            "3018": "Swift",
            "3019": "Python",
            "3020": "其他",
            "3371": "Java零基础",
            "3372": "Go语言"
        },
        "name": "编程语言"
    },
    "2003": {
        "list": {
            "3021": "Android开发",
            "3022": "iOS开发",
            "3023": "跨平台APP开发",
            "3218": "其他",
            "3251": "微信开发"
        },
        "name": "移动开发"
    },
    "2004": {
        "list": {
            "3338": "技术专题课",
            "3353": "0基础就业课",
            "3356": "实战进阶课",
            "3381": "其他"
        },
        "name": "前端开发"
    },
    "2005": {
        "list": {
            "3030": "Linux运维",
            "3032": "Python自动化运维",
            "3033": "信息安全",
            "3220": "其他",
            "3255": "DevOps"
        },
        "name": "网络与运维"
    },
    "2006": {
        "list": {
            "3034": "自动化测试",
            "3252": "零基础入门",
            "3253": "其他",
            "3254": "测试开发",
            "3382": "性能测试",
            "3385": "ISTQB考证"
        },
        "name": "软件测试"
    },
    "2007": {
        "list": {
            "3035": "云计算",
            "3036": "大数据",
            "3221": "其他",
            "3295": "人工智能",
            "3317": "区块链",
            "3325": "物联网"
        },
        "name": "云计算大数据"
    },
    "2008": {
        "list": {
            "3039": "Unity3d游戏开发",
            "3040": "Cocos2d-x游戏开发",
            "3041": "Html5游戏",
            "3042": "VR/AR",
            "3222": "其他",
            "3300": "游戏服务器开发",
            "3331": "OpenGL 开发",
            "3333": "egret 游戏开发",
            "3365": "UE4"
        },
        "name": "游戏开发"
    },
    "2009": {
        "list": {
            "3043": "思科认证",
            "3044": "华为认证",
            "3045": "软考",
            "3047": "红帽认证",
            "3050": "其他",
            "3379": "腾讯云认证"
        },
        "name": "认证考试"
    },
    "2010": {
        "list": {
            "3058": "淘宝营销",
            "3297": "拼多多营销",
            "3314": "京东营销",
            "3386": "其他"
        },
        "name": "电商平台"
    },
    "2011": {
        "list": {
            "3061": "摄影后期",
            "3063": "综合平面设计",
            "3239": "电商美工"
        },
        "name": "平面设计"
    },
    "2012": {
        "list": {
            "3065": "交互设计",
            "3066": "游戏UI设计",
            "3067": "Web UI设计",
            "3068": "APP  UI设计",
            "3226": "其他",
            "3323": "腾讯设计学院"
        },
        "name": "UI设计"
    },
    "2013": {
        "list": {
            "3070": "Photoshop",
            "3071": "Indesign",
            "3072": "Axure",
            "3073": "CDR",
            "3074": "Illustrator",
            "3075": "Dreamweaver",
            "3076": "CAD",
            "3077": "UG",
            "3078": "Solidworks",
            "3079": "Sketchup",
            "3080": "Rhino3D",
            "3081": "Pro/E",
            "3082": "ZBrush",
            "3083": "Cinema 4D",
            "3084": "SAI",
            "3085": "Flash",
            "3086": "3DMAX",
            "3087": "MAYA",
            "3088": "VRay",
            "3089": "AE",
            "3090": "Premiere",
            "3091": "Fireworks",
            "3227": "其他"
        },
        "name": "设计软件"
    },
    "2014": {
        "list": {
            "3092": "游戏角色设计",
            "3093": "场景概念设计",
            "3094": "游戏模型设计",
            "3095": "游戏特效设计",
            "3228": "其他",
            "3324": "游戏美宣"
        },
        "name": "游戏美术设计"
    },
    "2015": {
        "list": {
            "3097": "插画",
            "3098": "国画油画",
            "3099": "水彩水粉画",
            "3229": "彩铅手绘",
            "3242": "素描",
            "3374": "漫画绘本",
            "3375": "其他"
        },
        "name": "绘画创作"
    },
    "2016": {
        "list": {
            "3100": "特效与后期",
            "3102": "包装与剪辑",
            "3230": "其他",
            "3373": "动画设计"
        },
        "name": "影视设计"
    },
    "2017": {
        "list": {
            "3103": "室内设计",
            "3104": "建筑设计",
            "3105": "景观设计",
            "3231": "其他"
        },
        "name": "环境艺术设计"
    },
    "2018": {
        "list": {
            "3106": "产品设计",
            "3107": "模具设计",
            "3108": "机械设计",
            "3109": "包装设计",
            "3232": "其他"
        },
        "name": "工业产品设计"
    },
    "2019": {
        "list": {
            "3110": "服装设计",
            "3233": "其他",
            "3369": "服装打版",
            "3370": "配饰设计"
        },
        "name": "服装设计"
    },
    "2020": {
        "list": {
            "3111": "英语口语",
            "3112": "词汇语法",
            "3113": "新概念英语",
            "3114": "学术英语",
            "3115": "职场英语",
            "3299": "青少年英语",
            "3368": "外语翻译"
        },
        "name": "实用英语"
    },
    "2021": {
        "list": {
            "3116": "雅思",
            "3117": "托福",
            "3118": "研究生留学",
            "3119": "留学指导",
            "3120": "K12留学"
        },
        "name": "出国留学"
    },
    "2022": {
        "list": {
            "3121": "英语四级",
            "3122": "英语六级"
        },
        "name": "英语四六级"
    },
    "2023": {
        "list": {
            "3123": "日语零基础",
            "3124": "日语初级",
            "3125": "日语中高级",
            "3126": "兴趣日语",
            "3127": "日语考试",
            "3128": "日本留学"
        },
        "name": "日语"
    },
    "2024": {
        "list": {
            "3129": "韩语零基础",
            "3130": "韩语初级",
            "3131": "韩语中高级",
            "3132": "旅游韩语",
            "3133": "韩流文化",
            "3134": "TOPIK考试／留学"
        },
        "name": "韩语"
    },
    "2025": {
        "list": {
            "3135": "法语",
            "3136": "德语",
            "3137": "西班牙语",
            "3138": "葡萄牙语",
            "3139": "方言",
            "3235": "其他"
        },
        "name": "小语种"
    },
    "2027": {
        "list": {
            "3243": "公务员",
            "3244": "事业单位",
            "3245": "教师考试",
            "3246": "金融银行",
            "3248": "企业招聘/其他招考"
        },
        "name": "公考求职"
    },
    "2028": {
        "list": {
            "3154": "会计职称",
            "3155": "注册会计师",
            "3156": "国际证书",
            "3157": "金融类从业",
            "3160": "会计实务操作",
            "3161": "其他财经类考试"
        },
        "name": "财会金融"
    },
    "2029": {
        "list": {
            "3162": "一级建造师",
            "3163": "二级建造师",
            "3164": "消防工程师",
            "3165": "工程造价（实操）",
            "3166": "工程施工（技能）",
            "3167": "注册工程师",
            "3316": "其他建工类培训"
        },
        "name": "建筑工程"
    },
    "2031": {
        "list": {
            "3174": "规划指导",
            "3175": "考研英语",
            "3176": "考研政治",
            "3177": "考研数学",
            "3178": "专业课",
            "3236": "其他",
            "3380": "管综"
        },
        "name": "考研"
    },
    "2032": {
        "list": {
            "3179": "高考备战",
            "3180": "高二",
            "3181": "高一"
        },
        "name": "高中"
    },
    "2033": {
        "list": {
            "3182": "中考备战",
            "3183": "初二",
            "3184": "初一"
        },
        "name": "初中"
    },
    "2034": {
        "list": {
            "3185": "语文",
            "3186": "数学",
            "3187": "英语",
            "3188": "其他",
            "3189": "小升初备战"
        },
        "name": "小学"
    },
    "2035": {
        "list": {
            "3190": "证券投资",
            "3191": "期权期货",
            "3192": "外汇衍生",
            "3193": "其他"
        },
        "name": "投资理财"
    },
    "2036": {
        "list": {
            "3194": "婚恋交友",
            "3195": "时尚美妆",
            "3196": "家居家装",
            "3197": "养生保健",
            "3200": "其他",
            "3291": "美食烹饪",
            "3292": "动植育养"
        },
        "name": "生活百科"
    },
    "2037": {
        "list": {
            "3205": "棋牌",
            "3206": "摄影",
            "3208": "其他",
            "3270": "传统文化",
            "3271": "手工手艺",
            "3272": "TED公开课",
            "3289": "益智休闲",
            "3294": "书法"
        },
        "name": "文艺修养"
    },
    "2038": {
        "list": {
            "3209": "科学孕产",
            "3210": "育儿护理",
            "3211": "亲子启蒙",
            "3281": "家庭教育",
            "3282": "其他",
            "3315": "少儿编程"
        },
        "name": "母婴亲子"
    },
    "2039": {
        "list": {
            "3212": "执业药师",
            "3213": "执业医师",
            "3214": "执业护士",
            "3215": "卫生资格",
            "3216": "其他医疗类培训",
            "3298": "妇幼课堂",
            "3312": "医学升学",
            "3334": "中医技能",
            "3367": "健康管理师"
        },
        "name": "医疗卫生"
    },
    "2041": {
        "list": {
            "3234": "其他"
        },
        "name": "其他"
    },
    "2042": {
        "list": {
            "3237": "自考",
            "3238": "专升本",
            "3376": "公共课",
            "3377": "专业课"
        },
        "name": "大学"
    },
    "2043": {
        "list": {
            "3240": "嵌入式开发",
            "3318": "IC设计",
            "3320": "其他"
        },
        "name": "硬件研发"
    },
    "2044": {
        "list": {
            "3140": "办公软件",
            "3143": "技工技能",
            "3144": "创业教育",
            "3145": "企业培训",
            "3170": "人力资源",
            "3171": "心理咨询",
            "3172": "计算机等级考试",
            "3249": "其他"
        },
        "name": "职业技能"
    },
    "2046": {
        "list": {
            "3256": "法律硕士",
            "3257": "法律职业资格",
            "3280": "法律实务",
            "3283": "趣味学法",
            "3302": "警法考试"
        },
        "name": "法学院"
    },
    "2047": {
        "list": {
            "3259": "音乐基础",
            "3275": "唱歌发声",
            "3276": "乐器演奏",
            "3278": "音乐制作",
            "3279": "其他"
        },
        "name": "音乐乐器"
    },
    "2049": {
        "list": {
            "3284": "体育休闲",
            "3285": "健身训练",
            "3286": "舞蹈健美",
            "3287": "武术格斗",
            "3288": "其他",
            "3366": "电子竞技"
        },
        "name": "运动健康"
    },
    "2050": {
        "list": {
            "3313": "亚马逊",
            "3357": "速卖通",
            "3358": "阿里国际站",
            "3359": "独立站",
            "3360": "Shopee(虾皮)",
            "3378": "其他平台"
        },
        "name": "跨境电商"
    },
    "2051": {
        "list": {
            "3059": "社群营销",
            "3361": "直播短视频电商",
            "3362": "微信电商",
            "3387": "其他"
        },
        "name": "社交电商"
    },
    "2052": {
        "list": {
            "3223": "其他"
        },
        "name": "其他"
    },
    "2053": {
        "list": {
            "3383": "种植",
            "3384": "畜牧养殖"
        },
        "name": "农业生产"
    }
}

function getTwoTypeList() {
    let obj = {}
    for (let key in typeList) {
        for (let key2 in typeList[key]['list']) {
            obj[key2] = typeList[key]['list'][key2]
        }
    }
    return obj;
}

var twoTypeList = getTwoTypeList()

module.exports = {
    typeList,
    twoTypeList
}