var typeList = {
    "2001": {
        "list": {
            "3001": "产品策划",
            "3002": "游戏策划",
            "3003": "产品运营",
            "3004": "游戏运营",
            "3051": "网络营销理论",
            "3296": "新媒体营销"
        },
        "name": "互联网产品"
    },
    "2003": {
        "list": {
            "3021": "Android开发",
            "3022": "iOS开发",
            "3023": "小程序开发",
            "3251": "微信开发"
        },
        "name": "移动开发"
    },
    "2004": {
        "list": {
            "3356": "前端基础课程",
            "3239": "平面设计",
            "3323": "UI设计",
            "3089": "设计软件",
            "3324": "游戏美术设计"
        },
        "name": "前端开发"
    },
    "2005": {
        "list": {
            "3030": "网络与运维",
            "3032": "软件测试",
            "3033": "云计算大数据",
            "3005": "C",
            "3006": "C++",
            "3007": "Java进阶",
            "3019": "Python",
            "3371": "Java零基础",
            "3372": "Go语言"
        },
        "name": "后端开发"
    },
    "2008": {
        "list": {
            "3039": "Unity3d游戏开发",
            "3040": "Cocos2d-x游戏开发",
            "3041": "Html5游戏",
        },
        "name": "游戏开发"
    },
    "2043": {
        "list": {
            "3240": "嵌入式开发",
            "3318": "IC设计",
        },
        "name": "硬件研发"
    },
    "2009": {
        "list": {
            "3043": "思科认证",
            "3044": "华为认证",
            "3045": "软考",
            "3047": "红帽认证",
            "3379": "腾讯云认证"
        },
        "name": "认证考试"
    },
    "2010": {
        "list": {
            "3058": "淘宝营销",
            "3297": "拼多多营销",
            "3314": "京东营销",
        },
        "name": "电商平台"
    },
    "2015": {
        "list": {
            "3097": "插画",
            "3098": "国画油画",
            "3099": "水彩水粉画",
        },
        "name": "绘画创作"
    },
    "2016": {
        "list": {
            "3100": "环境艺术设计",
            "3102": "影视设计",
            "3373": "动画设计",
            "3109": "工业产品设计",
            "3370": "服装设计"
        },
        "name": "设计"
    },
    "2020": {
        "list": {
            "3111": "实用英语",
            "3112": "出国留学",
            "3113": "英语四六级",
            "3114": "日语",
            "3115": "小语种",
        },
        "name": "外语"
    },
    "2027": {
        "list": {
            "3243": "公考求职",
            "3244": "职业技能",
            "3245": "教师考试",
        },
        "name": "社会职考"
    },
    "2028": {
        "list": {
            "3154": "会计职称",
            "3155": "注册会计师",
            "3156": "国际证书",
        },
        "name": "财会金融"
    },
    "2032": {
        "list": {
            "3179": "高中",
            "3180": "初中",
            "3181": "小学",
            "3377": "大学",
            "3177": "考研",
            "3302": "法学院"
        },
        "name": "学校"
    },
    "2047": {
        "list": {
            "3259": "音乐基础",
            "3275": "唱歌发声",
            "3276": "舞蹈",
            "3278": "音乐制作",
        },
        "name": "音乐舞蹈"
    }
}

function getTwoTypeList() {
    let obj = {}
    for (let key in typeList) {
        for (let key2 in typeList[key]['list']) {
            obj[key2] = typeList[key]['list'][key2]
        }
    }
    return obj;
}

var twoTypeList = getTwoTypeList()

module.exports = {
    typeList,
    twoTypeList
}